## Pandas

In [2]:
import pandas as pd
import numpy as np

## Series

In [11]:
a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
# List
b = pd.Series([1,2,3,4,5] , index = ["a" ,"b" ,"c" ,"d" , "e"])
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
# Dictionary
c = pd.Series({"a" : 1 , "b" : 2 , "c" : 3})
print(c)

a    1
b    2
c    3
dtype: int64

In [14]:
d = pd.Series(5 , index = ["a" ,"b" ,"c" ,"d" , "e"])
print(d)

a    5
b    5
c    5
d    5
e    5
dtype: int64

### DataFrame

In [ ]:
data = {
    'name' : ['pratham' , 'john' , 'henry' , 'shawn'],
    'age'  : [20 , 25 , 30 , 35]
}

df = pd.DataFrame(data , index = ["a" , "b" , "c" , "d"]) # default index is 0,1,2,3,..
print(df)

      name  age
a  pratham   20
b     john   25
c    henry   30
d    shawn   35

In [27]:
data = {
    'name' : ['pratham' , 'john' , 'henry' , 'shawn'],
    'age'  : [20 , 25 , 30 , 35]
}

df = pd.DataFrame(data , index = ["a" , "b" , "c" , "d"]) # default index is 0,1,2,3,..
print("Index : " , df.index)
print("\nIndex :\n" , df.name)
print("\nAge :\n" , df.age)
print("\nSpecific element :\n" , df.name.get("a"))

Index :  Index(['a', 'b', 'c', 'd'], dtype='object')

Index :
 a    pratham
b       john
c      henry
d      shawn
Name: name, dtype: object

Age :
 a    20
b    25
c    30
d    35
Name: age, dtype: int64

Specific element :
 pratham

## Inspecting Data or Viewing Data

In [57]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , np.nan , 'amit'
              ,'neha' , 'vikas' , 'pooja' , 'ajay' , np.nan
              ,'sneha' , 'raj' , 'vivek' , 'john' , 'joker'
              , 'kalpesh' , 'sahil' , 'nikhil' , 'suresh' , 'hemat' 
              ],

    'age'   : [ 20 , 22 , 33 , np.nan , 64 , 88 , 23 , 34 , 11 , np.nan , 
               55 , 36 , 78 , 98 , np.nan , 67 , 65 , 87 , 12 , 45 
               ]
}

# df = pd.DataFrame(data , index = [i+1 for i in range(len(data['name']))])
df = pd.DataFrame(data )
print("Data :\n" , df)
print("\nTop 5 data entries :\n" , df.head())
print("\nBottom entries :\n" , df.tail(3))
df.info()

Data :
        name   age
0   pratham  20.0
1    suresh  22.0
2       raj  33.0
3       NaN   NaN
4      amit  64.0
5      neha  88.0
6     vikas  23.0
7     pooja  34.0
8      ajay  11.0
9       NaN   NaN
10    sneha  55.0
11      raj  36.0
12    vivek  78.0
13     john  98.0
14    joker   NaN
15  kalpesh  67.0
16    sahil  65.0
17   nikhil  87.0
18   suresh  12.0
19    hemat  45.0

Top 5 data entries :
       name   age
0  pratham  20.0
1   suresh  22.0
2      raj  33.0
3      NaN   NaN
4     amit  64.0

Bottom entries :
       name   age
17  nikhil  87.0
18  suresh  12.0
19   hemat  45.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    18 non-null     object
 1   age     17 non-null     float64
dtypes: float64(1), object(1)
memory usage: 452.0+ bytes

In [58]:
print("\nTotal null values:\n" , df.isnull().sum())
print("\nSatistical Summary :\n" , df.describe())
print("\nDuplicate entries : ", df['name'].duplicated())
print("\nTotal Duplicate entries : ", df['name'].duplicated().sum())

Total null values:
 name    2
age     3
dtype: int64

Satistical Summary :
              age
count  17.000000
mean   49.294118
std    28.252798
min    11.000000
25%    23.000000
50%    45.000000
75%    67.000000
max    98.000000

Duplicate entries :  0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11     True
12    False
13    False
14    False
15    False
16    False
17    False
18     True
19    False
Name: name, dtype: bool

Total Duplicate entries :  3

In [62]:
print("\nSort by index :\n" , df.sort_index())
print("\nSort by values :\n" , df.sort_values('age'))
# print("\nSort by index :\n" , df.sort_index())

Sort by index :
        name   age
0   pratham  20.0
1    suresh  22.0
2       raj  33.0
3       NaN   NaN
4      amit  64.0
5      neha  88.0
6     vikas  23.0
7     pooja  34.0
8      ajay  11.0
9       NaN   NaN
10    sneha  55.0
11      raj  36.0
12    vivek  78.0
13     john  98.0
14    joker   NaN
15  kalpesh  67.0
16    sahil  65.0
17   nikhil  87.0
18   suresh  12.0
19    hemat  45.0

Sort by values :
        name   age
8      ajay  11.0
18   suresh  12.0
0   pratham  20.0
1    suresh  22.0
6     vikas  23.0
2       raj  33.0
7     pooja  34.0
11      raj  36.0
19    hemat  45.0
10    sneha  55.0
4      amit  64.0
16    sahil  65.0
15  kalpesh  67.0
12    vivek  78.0
17   nikhil  87.0
5      neha  88.0
13     john  98.0
3       NaN   NaN
9       NaN   NaN
14    joker   NaN

## Column Selection or Indexing

In [ ]:
studentData = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , np.nan , 'amit'
              ,'neha' , 'vikas' , 'pooja' , 'ajay' , np.nan
              ,'sneha' , 'raj' , 'vivek' , 'john' , 'joker'
              , 'kalpesh' , 'sahil' , 'nikhil' , 'suresh' , 'hemat' 
              ],

    'age'   : [ 20 , 22 , 33 , np.nan , 64 , 88 , 23 , 34 , 11 , np.nan , 
               55 , 36 , 78 , 98 , np.nan , 67 , 65 , 87 , 12 , 45 
               ],

    'rollNo': [ 101 , 102 , 103 , 104 , 105 , 106 ,107 , 108 , 109 , 110 ,
               111 , 112 , 113 , 114 , 115 , 116 , 117 , 118 , 119 , 120
    ], 

    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai' , 
               'thane', 'panvel' , 'ulhasnagar', 'pune' , 'nerul' , 
               'juinagar' , 'airoli' , 'mumbra' , 'diva' , 'panvel',
               'sion' , 'csmt' , 'thane' , 'ulhasnagar' , 'kolkatta']
    
}

df = pd.DataFrame(studentData)
print("Multiple column Data :\n" , df[['name' , 'city']])
print("\nSelect row by integar location :\n" , df.iloc[10])
print("\nSlice row :\n" ,df[4:10])
print("\nSelect row by condition :\n" , df[df['age']>25])

Multiply column Data :
        name        city
0   pratham      mumbai
1    suresh        pune
2       raj    kolkatta
3       NaN      jhansi
4      amit      mumbai
5      neha       thane
6     vikas      panvel
7     pooja  ulhasnagar
8      ajay        pune
9       NaN       nerul
10    sneha    juinagar
11      raj      airoli
12    vivek      mumbra
13     john        diva
14    joker      panvel
15  kalpesh        sion
16    sahil        csmt
17   nikhil       thane
18   suresh  ulhasnagar
19    hemat    kolkatta

Select row by integar location :
 name         sneha
age           55.0
rollNo         111
city      juinagar
Name: 10, dtype: object

Slice row :
     name   age  rollNo        city
4   amit  64.0     105      mumbai
5   neha  88.0     106       thane
6  vikas  23.0     107      panvel
7  pooja  34.0     108  ulhasnagar
8   ajay  11.0     109        pune
9    NaN   NaN     110       nerul

Select row by condition :
        name   age  rollNo        city
2       raj  33.0     103    kolkatta
4      amit  64.0     105      mumbai
5      neha  88.0     106       thane
7     pooja  34.0     108  ulhasnagar
10    sneha  55.0     111    juinagar
11      raj  36.0     112      airoli
12    vivek  78.0     113      mumbra
13     john  98.0     114        diva
15  kalpesh  67.0     116        sion
16    sahil  65.0     117        csmt
17   nikhil  87.0     118       thane
19    hemat  45.0     120    kolkatta

## Column insertion

In [87]:
studentData = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , np.nan , 'amit'
              ,'neha' , 'vikas' , 'pooja' , 'ajay' , np.nan
              ,'sneha' , 'raj' , 'vivek' , 'john' , 'joker'
              , 'kalpesh' , 'sahil' , 'nikhil' , 'suresh' , 'hemat' 
              ],

    'age'   : [ 20 , 22 , 33 , np.nan , 64 , 88 , 23 , 34 , 11 , np.nan , 
               55 , 36 , 78 , 98 , np.nan , 67 , 65 , 87 , 12 , 45 
               ],

    'rollNo': [ 101 , 102 , 103 , 104 , 105 , 106 ,107 , 108 , 109 , 110 ,
               111 , 112 , 113 , 114 , 115 , 116 , 117 , 118 , 119 , 120
    ], 

    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai' , 
               'thane', 'panvel' , 'ulhasnagar', 'pune' , 'nerul' , 
               'juinagar' , 'airoli' , 'mumbra' , 'diva' , 'panvel',
               'sion' , 'csmt' , 'thane' , 'ulhasnagar' , 'kolkatta']
    
}
df = pd.DataFrame(studentData)

df["result"] = "Pass"
print(df)

df["Marks"] = [ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
print("\n",df)

       name   age  rollNo        city result
0   pratham  20.0     101      mumbai   Pass
1    suresh  22.0     102        pune   Pass
2       raj  33.0     103    kolkatta   Pass
3       NaN   NaN     104      jhansi   Pass
4      amit  64.0     105      mumbai   Pass
5      neha  88.0     106       thane   Pass
6     vikas  23.0     107      panvel   Pass
7     pooja  34.0     108  ulhasnagar   Pass
8      ajay  11.0     109        pune   Pass
9       NaN   NaN     110       nerul   Pass
10    sneha  55.0     111    juinagar   Pass
11      raj  36.0     112      airoli   Pass
12    vivek  78.0     113      mumbra   Pass
13     john  98.0     114        diva   Pass
14    joker   NaN     115      panvel   Pass
15  kalpesh  67.0     116        sion   Pass
16    sahil  65.0     117        csmt   Pass
17   nikhil  87.0     118       thane   Pass
18   suresh  12.0     119  ulhasnagar   Pass
19    hemat  45.0     120    kolkatta   Pass

        name   age  rollNo        city result  Marks
0   pratham  20.0     101      mumbai   Pass      1
1    suresh  22.0     102        pune   Pass      1
2       raj  33.0     103    kolkatta   Pass      1
3       NaN   NaN     104      jhansi   Pass      1
4      amit  64.0     105      mumbai   Pass      1
5      neha  88.0     106       thane   Pass      1
6     vikas  23.0     107      panvel   Pass      1
7     pooja  34.0     108  ulhasnagar   Pass      1
8      ajay  11.0     109        pune   Pass      1
9       NaN   NaN     110       nerul   Pass      1
10    sneha  55.0     111    juinagar   Pass      1
11      raj  36.0     112      airoli   Pass      1
12    vivek  78.0     113      mumbra   Pass      1
13     john  98.0     114        diva   Pass      1
14    joker   NaN     115      panvel   Pass      1
15  kalpesh  67.0     116        sion   Pass      1
16    sahil  65.0     117        csmt   Pass      1
17   nikhil  87.0     118       thane   Pass      1
18   suresh  12.0     119  ulhasnagar   Pass      1
19    hemat  45.0     120    kolkatta   Pass      1

In [ ]:
hobbies = [ 'cricket' , 'football' , 'vollyball' , 'chess' , 'hockey',
           'cricket' , 'tennis' , 'carrom' , 'football' , np.nan,
           'carrom' , 'chess' , 'bgmi' , 'reading' , 'coding',
           np.nan , 'football' , 'coding' , 'chess' , np.nan]

df.insert(2 , "hobbies" , hobbies)

In [96]:
df['fees'] = df['Marks'] * 2
print(df)

       name   age    hobbies  rollNo        city result  Marks  fees
0   pratham  20.0    cricket     101      mumbai   Pass      1     2
1    suresh  22.0   football     102        pune   Pass      1     2
2       raj  33.0  vollyball     103    kolkatta   Pass      1     2
3       NaN   NaN      chess     104      jhansi   Pass      1     2
4      amit  64.0     hockey     105      mumbai   Pass      1     2
5      neha  88.0    cricket     106       thane   Pass      1     2
6     vikas  23.0     tennis     107      panvel   Pass      1     2
7     pooja  34.0     carrom     108  ulhasnagar   Pass      1     2
8      ajay  11.0   football     109        pune   Pass      1     2
9       NaN   NaN        NaN     110       nerul   Pass      1     2
10    sneha  55.0     carrom     111    juinagar   Pass      1     2
11      raj  36.0      chess     112      airoli   Pass      1     2
12    vivek  78.0       bgmi     113      mumbra   Pass      1     2
13     john  98.0    reading     114        diva   Pass      1     2
14    joker   NaN     coding     115      panvel   Pass      1     2
15  kalpesh  67.0        NaN     116        sion   Pass      1     2
16    sahil  65.0   football     117        csmt   Pass      1     2
17   nikhil  87.0     coding     118       thane   Pass      1     2
18   suresh  12.0      chess     119  ulhasnagar   Pass      1     2
19    hemat  45.0        NaN     120    kolkatta   Pass      1     2

## Column Updation

In [110]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , 33 , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai'],
    'marks' : [1,1,1,1,1],
    'gender' : [ 'm' , 'm' , 'm' , 'f' , 'f' ]
}

df = pd.DataFrame(data)
print(df)

df['marks'] = 100
print("\nAfter Updation :\n",df)

df.loc[df['rollNo'] == 101 , 'marks'] = 999
print("\nUpdated Pratham marks :\n",df)

print("\nReplace values :\n" , df.replace('mumbai' , 'ulhasnagar'))

      name  age  rollNo      city  marks gender
0  pratham   20     101    mumbai      1      m
1   suresh   22     102      pune      1      m
2      raj   33     103  kolkatta      1      m
3    sneha   43     104    jhansi      1      f
4  kalpana   64     105    mumbai      1      f

After Updation :
       name  age  rollNo      city  marks gender
0  pratham   20     101    mumbai    100      m
1   suresh   22     102      pune    100      m
2      raj   33     103  kolkatta    100      m
3    sneha   43     104    jhansi    100      f
4  kalpana   64     105    mumbai    100      f

Updated Pratham marks :
       name  age  rollNo      city  marks gender
0  pratham   20     101    mumbai    999      m
1   suresh   22     102      pune    100      m
2      raj   33     103  kolkatta    100      m
3    sneha   43     104    jhansi    100      f
4  kalpana   64     105    mumbai    100      f

Replace values :
       name  age  rollNo        city  marks gender
0  pratham   20     101  ulhasnagar    999      m
1   suresh   22     102        pune    100      m
2      raj   33     103    kolkatta    100      m
3    sneha   43     104      jhansi    100      f
4  kalpana   64     105  ulhasnagar    100      f

## Column Deletion

In [122]:
newData = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , 33 , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai'],
    'marks' : [1,1,1,1,1],
    'gender' : [ 'm' , 'm' , 'm' , 'f' , 'f' ]
}

df = pd.DataFrame(newData)
print(df)
# delete single cloumn
del df['gender']
print("\nAfter deletion of column gender :\n ", df)

# delete multiple column 
updateData = df.drop(columns=['city' , 'marks'])
print("\nMultiple column deltion :\n" , updateData)

# delete duplicate column
# print("\nDelete Duplicates :\n", df.drop_duplicates(''))

      name  age  rollNo      city  marks gender
0  pratham   20     101    mumbai      1      m
1   suresh   22     102      pune      1      m
2      raj   33     103  kolkatta      1      m
3    sneha   43     104    jhansi      1      f
4  kalpana   64     105    mumbai      1      f

After deletion of column gender :
        name  age  rollNo      city  marks
0  pratham   20     101    mumbai      1
1   suresh   22     102      pune      1
2      raj   33     103  kolkatta      1
3    sneha   43     104    jhansi      1
4  kalpana   64     105    mumbai      1

Multiple column deltion :
       name  age  rollNo
0  pratham   20     101
1   suresh   22     102
2      raj   33     103
3    sneha   43     104
4  kalpana   64     105

## Filter

In [9]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , 33 , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'marks' : [100,112,190,112,150],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai']
}

df = pd.DataFrame(data)
print(df)

dt1 = df[df['age'].isin([20,64])]
print("\n",dt1)

      name  age  rollNo  marks      city
0  pratham   20     101    100    mumbai
1   suresh   22     102    112      pune
2      raj   33     103    190  kolkatta
3    sneha   43     104    112    jhansi
4  kalpana   64     105    150    mumbai

       name  age  rollNo  marks    city
0  pratham   20     101    100  mumbai
4  kalpana   64     105    150  mumbai

## Missing Data

In [ ]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , np.nan , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'marks' : [100,np.nan,190,np.nan,150],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai']
}

df = pd.DataFrame(data)
print(df)

# Boolean mask where values are nan
print()
print(df.isna())

print("\n", df.isna().sum())

# Filling missing data
print(df.fillna(value=123))

# use backward and forward filling to get accurate data
# print(df.bfill())  # it will print value below the nan
# print(df.ffill())  # it will print value above the nan

# To drop missing data
# print(df.dropna())

      name   age  rollNo  marks      city
0  pratham  20.0     101  100.0    mumbai
1   suresh  22.0     102    NaN      pune
2      raj   NaN     103  190.0  kolkatta
3    sneha  43.0     104    NaN    jhansi
4  kalpana  64.0     105  150.0    mumbai

    name    age  rollNo  marks   city
0  False  False   False  False  False
1  False  False   False   True  False
2  False   True   False  False  False
3  False  False   False   True  False
4  False  False   False  False  False

 name      0
age       1
rollNo    0
marks     2
city      0
dtype: int64
      name    age  rollNo  marks      city
0  pratham   20.0     101  100.0    mumbai
1   suresh   22.0     102  123.0      pune
2      raj  123.0     103  190.0  kolkatta
3    sneha   43.0     104  123.0    jhansi
4  kalpana   64.0     105  150.0    mumbai

## Statistical Data

In [29]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , np.nan , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'marks' : [100,np.nan,190,np.nan,150],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai']
}

df = pd.DataFrame(data)
print(df)

# calculating the mean of 'age' column
age_mean = df['age'].mean()
print("\nThe mean of age is : ", age_mean)

# calculating the mean of 'age' and 'marks' column 
selected_mean = df[['age' , 'marks']].mean()
print("\nThe mean of 'age' and 'marks' is :\n" , selected_mean)

# Apply single Aggreation function
agg_age_mean = df['age'].agg('mean')
print("\nmean age : ", agg_age_mean)

# Apply multiple Aggreation function
agg_age_stats = df['age'].agg(['mean', 'min' , 'max'])
print("\nAge statistics :\n", agg_age_stats)

# Apply different aggreation function to different columns
custom_agg = df.agg({
    'age' : ['mean', 'min' , 'max', 'count'],
    'marks' : 'sum',
    'rollNo' : 'count'
})
print("\ncustom aggreation is :\n" , custom_agg)

      name   age  rollNo  marks      city
0  pratham  20.0     101  100.0    mumbai
1   suresh  22.0     102    NaN      pune
2      raj   NaN     103  190.0  kolkatta
3    sneha  43.0     104    NaN    jhansi
4  kalpana  64.0     105  150.0    mumbai

The mean of age is :  37.25

The mean of 'age' and 'marks' is :
 age       37.250000
marks    146.666667
dtype: float64

mean age :  37.25

Age statistics :
 mean    37.25
min     20.00
max     64.00
Name: age, dtype: float64

custom aggreation is :
          age  marks  rollNo
mean   37.25    NaN     NaN
min    20.00    NaN     NaN
max    64.00    NaN     NaN
count   4.00    NaN     5.0
sum      NaN  440.0     NaN

## Transformation

In [32]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'kalpana' ],
    'age'   : [ 20 , 22 , np.nan , 43 , 64 ],
    'rollNo': [ 101 , 102 , 103 , 104 , 105 ], 
    'marks' : [100,np.nan,190,np.nan,150],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'jhansi', 'mumbai']
}

df = pd.DataFrame(data)
print(df)

# Apply single transformation function
age_plus_one = df['age'].transform(lambda x : x + 1)
print("\nUpdated age is :\n", age_plus_one)

# Apply multiple transformation function
multiple_trans = df[['age' , 'marks']].transform(lambda x : x + 1)
print("\nUpdated age and marks is :\n", multiple_trans)

# Apply different transformation function to different columns
df_transform = df.transform({
    'age' : lambda x : x + 1,
    'marks' : lambda x : x * 2
})
print("\nUpadted Data is :\n", df_transform)

      name   age  rollNo  marks      city
0  pratham  20.0     101  100.0    mumbai
1   suresh  22.0     102    NaN      pune
2      raj   NaN     103  190.0  kolkatta
3    sneha  43.0     104    NaN    jhansi
4  kalpana  64.0     105  150.0    mumbai

Updated age is :
 0    21.0
1    23.0
2     NaN
3    44.0
4    65.0
Name: age, dtype: float64

Updated age and marks is :
     age  marks
0  21.0  101.0
1  23.0    NaN
2   NaN  191.0
3  44.0    NaN
4  65.0  151.0

Upadted Data is :
     age  marks
0  21.0  200.0
1  23.0    NaN
2   NaN  380.0
3  44.0    NaN
4  65.0  300.0

## Value Count

In [36]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha' , 'raj' , 'pratham' , 'suresh' ],
    'age'   : [ 20 , 22 , 20, 43 , 22, 43 , 22 ],
    'marks' : [100,102,190,190,150 , 100 , 160],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'pune', 'mumbai' , 'kolkatta' , 'pune']
}

df = pd.DataFrame(data)
print(df)

city_count = df['city'].value_counts().sort_index()
print("\ncity counts :\n" , city_count)

      name  age  marks      city
0  pratham   20    100    mumbai
1   suresh   22    102      pune
2      raj   20    190  kolkatta
3    sneha   43    190      pune
4      raj   22    150    mumbai
5  pratham   43    100  kolkatta
6   suresh   22    160      pune

city counts :
 city
kolkatta    2
mumbai      2
pune        3
Name: count, dtype: int64

## String Methods

In [ ]:
data = {
    'name' : [ 'pratham' , 'suresh' , 'raj' , 'sneha'],
    'age'   : [ 20 , 22 , 20, 43  ],
    'marks' : [100,102,190,190],
    'city'  : [ 'mumbai' , 'pune' , 'kolkatta' , 'pune']
}

df = pd.DataFrame(data)
print(df)

print("\nuppercase cities :\n" , df['city'].str.upper())

print("\nstring length cities:\n", df['city'].str.len())

# same as python....

      name  age  marks      city
0  pratham   20    100    mumbai
1   suresh   22    102      pune
2      raj   20    190  kolkatta
3    sneha   43    190      pune

uppercase cities :
 0      MUMBAI
1        PUNE
2    KOLKATTA
3        PUNE
Name: city, dtype: object

string length cities:
 0    6
1    4
2    8
3    4
Name: city, dtype: int64

## Merge

In [47]:
df1 = pd.DataFrame({
    'id' : [ 1, 2, 3 , 4],
    'name' : [ 'pratham' ,'shawn', 'john' ,'ronnie']
})

df2 = pd.DataFrame({
    'id' : [ 3, 4, 5 , 6],
    'score' : [ 90 , 40 ,50 ,80 ]
})

## Inner join 
inner_join  = pd.merge(df1,df2, on ='id')
print("Inner join :\n" , inner_join)

# Left join
left_join  = pd.merge(df1,df2, on ='id', how='left')
print("\nleft join :\n" , left_join)

## Right join
right_join  = pd.merge(df1,df2, on ='id', how='right')
print("\nright join :\n" , right_join)

## Outer join
outer_join  = pd.merge(df1,df2, on ='id', how='outer')
print("\nouter join :\n" , outer_join)

Inner join :
    id    name  score
0   3    john     90
1   4  ronnie     40

left join :
    id     name  score
0   1  pratham    NaN
1   2    shawn    NaN
2   3     john   90.0
3   4   ronnie   40.0

right join :
    id    name  score
0   3    john     90
1   4  ronnie     40
2   5     NaN     50
3   6     NaN     80

outer join :
    id     name  score
0   1  pratham    NaN
1   2    shawn    NaN
2   3     john   90.0
3   4   ronnie   40.0
4   5      NaN   50.0
5   6      NaN   80.0

In [48]:
# If the id is not same 
df1 = pd.DataFrame({
    'id' : [ 1, 2, 3 , 4],
    'name' : [ 'pratham' ,'shawn', 'john' ,'ronnie']
})

df2 = pd.DataFrame({
    'stu_id' : [ 3, 4, 5 , 6],
    'score' : [ 90 , 40 ,50 ,80 ]
})

## Inner join 
inner_join  = pd.merge(df1,df2, left_on='id' , right_on='stu_id')
print("Inner join :\n" , inner_join)

Inner join :
    id    name  stu_id  score
0   3    john       3     90
1   4  ronnie       4     40

## Concat

In [51]:
df1 = pd.DataFrame({
    'A' : ['A0' , 'A1' , 'A2' ,'A3'],
    'B' : ['B0' , 'B1' , 'B2' ,'B3'],
})

df2 = pd.DataFrame({
    'A' : ['A4' , 'A4' , 'A5' ,'A6'],
    'B' : ['B4' , 'B5' , 'B6' ,'B7'],
})

df3 = pd.DataFrame({
    'C' : ['C0' , 'C1' , 'C2' ,'C3'],
    'D' : ['D0' , 'D1' , 'D2' ,'D3'],
})

# Vertical concatenation
vertical_concat = pd.concat([df1,df2])
print("\nVertical concatenation :\n" , vertical_concat)

# Horizontal concatenation
horizontal_concat = pd.concat([df1,df2] , axis=1)
print("\nHorizontal concatenation :\n" , horizontal_concat)

# concatenation with different column
different_column_concat = pd.concat([df1,df3] , axis=1)
print("\nDifferent column concatenation :\n" , different_column_concat)

Vertical concatenation :
     A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  A4  B4
1  A4  B5
2  A5  B6
3  A6  B7

Horizontal concatenation :
     A   B   A   B
0  A0  B0  A4  B4
1  A1  B1  A4  B5
2  A2  B2  A5  B6
3  A3  B3  A6  B7

Different column concatenation :
     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

## Grouping